Revit 2027 API
FailureHandlingOptions.GetFailuresPreprocessor Method
 Gets the callback to be invoked in the beginning of failure processing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFailuresPreprocessor GetFailuresPreprocessor()
Public Function GetFailuresPreprocessor As IFailuresPreprocessor
public:
IFailuresPreprocessor^ GetFailuresPreprocessor()
member GetFailuresPreprocessor : unit -> IFailuresPreprocessor
Return Value
IFailuresPreprocessor
 The callback to be invoked in the beginning of failure processing.
See Also
Reference
FailureHandlingOptions Class
Autodesk.Revit.DB Namespace